test/02-test-soap/02-client/02-jersey-client-resources/src/main/resources/data.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:getText xmlns:ns2="http://soap/">
            <arg0>tom</arg0>
        </ns2:getText>
    </S:Body>
</S:Envelope>
